import * as React from "react";
import PropTypes from "prop-types";
import Tabs from "@mui/material/Tabs";
import Tab from "@mui/material/Tab";
import Typography from "@mui/material/Typography";
import Box from "@mui/material/Box";
import Grid from "@mui/material/Grid";
import "./styles/styles.scss";

const TabPanel = (props) => {
  const { children, value, index, ...other } = props;

  return (
    <div
      role="tabpanel"
      hidden={value !== index}
      id={`vertical-tabpanel-${index}`}
      aria-labelledby={`vertical-tab-${index}`}
      {...other}
    >
      {value === index && (
        <Box sx={{ p: 3 }}>
          <Typography component="div">{children}</Typography>
        </Box>
      )}
    </div>
  );
};

TabPanel.propTypes = {
  children: PropTypes.node,
  index: PropTypes.number.isRequired,
  value: PropTypes.number.isRequired,
};

const Services = ({ a11yProps, handleChange, value }) => {
  const scrollIntoView = (refName) => {
    const element = document.getElementById(refName);
    setTimeout(() => {
      window.scrollTo({
        behavior: element ? "smooth" : "auto",
        top: element.offsetTop,
      });
    }, 100);
  };

  return (
    <div id="item-1">
      <div className="bg-contacts">
        <h1 className="m-3">Услуги</h1>
      </div>
      <div className="d-flex">
        <Grid container spacing={2}>
          <Grid
            item
            xs={12}
            sm={12}
            lg={6}
            md={12}
            className="align-items-center"
          >
            <div
              style={{
                display: "grid",
                justifyContent: "center",
              }}
            >
              <Tab
                style={{
                  fontSize: 25,
                  fontWeight: 500,
                  textDecoration: "underline",
                }}
                label="Вакуактив"
                href="/vacu-active"
              />
              <a href="/venus-viva" className="my-3 text-center">
                <img src="logo_venus.png" width={120} />
              </a>
            </div>
            <Tabs
              orientation="vertical"
              variant="scrollable"
              value={value}
              onChange={handleChange}
              aria-label="Vertical tabs example"
              sx={{ borderRight: 1, borderColor: "divider" }}
              style={{ alignItems: "center", marginTop: 15 }}
            >
              <Tab label="Ролшейп" {...a11yProps(0)} />
              <Tab label="Телесен анализ 'ТАНИТА'" {...a11yProps(1)} />
              <Tab label="Мезотерапия" {...a11yProps(2)} />
              <Tab label="Микроблейдинг" {...a11yProps(3)} />
              <Tab label="Химични пилинги" {...a11yProps(4)} />
              <Tab label="Дермабразио" {...a11yProps(5)} />
              <Tab label="Инжектор пен" {...a11yProps(6)} />
              <Tab label="Други услуги" {...a11yProps(7)} />
            </Tabs>
          </Grid>
          <Grid item xs={12} sm={12} md={12} lg={6}>
            <TabPanel value={value} index={0} className="text-center">
              <h3 className="text-center"> Как работи Roll Shape? </h3>
              <div className="p-5 pt-0 paper-bg">
                <div style={{ textAlign: "justify" }} className="p-2">
                  Това е лимфодренажен масаж, чрез който цялата лимфна система
                  се стимулира и извежда токсините от тялото. Кръвта циркулира
                  чрез комплексна система от кръвоносни съдове. Респективно,
                  лимфната система също. Единствената разлика е в това, че
                  кръвта в тялото се изпомпва чрез естествен „мотор“ – сърцето.
                  Лимфната система няма такъв и се стимулира единствено от
                  мускулната активност. Ето защо лимфната циркулация понякога е
                  слаба и затова трябва да се погрижим за нея. Ръчният
                  лимфодренажен масаж изисква добро познание на човешката
                  анатомия и лимфната циркулация. Процедурите с{" "}
                  <strong>RollShape </strong>
                  изискват единствено да се следват инструкциите – чрез
                  директния допир с въртящият се барабан на уреда се масажира
                  тази част от тялото, която желаете.
                </div>
                <span className="text-center my-2">
                  <strong> Защо лимфната циркулация е толкова важна?</strong>
                </span>
                <div style={{ textAlign: "justify" }}>
                  Тази система изчиства вашето тяло и му доставя вътрешна
                  хидратация. Това е нейната главна функция – да изчиства и
                  детоксикира тялото, хидратира вътрешната тъкан, укрепва
                  имунната система , докато подсилва вашият метаболизъм. Когато
                  лимфната циркулация е затруднена, тъканите не са хидратирани
                  правилно. Това е свързано със състоянието на кожата, по-бързо
                  образуване на бръчки, торбички под очите и най-големият враг
                  на жените- целулита.
                </div>
                <span className="text-center my-2">
                  <strong>Защо да изберем Roll Shape?</strong>
                </span>
                <div style={{ textAlign: "justify" }}>
                  <strong>RollShape</strong> – уред за ролков масаж, който ви
                  позволява самостоятелно да третирате почти всички зони на
                  тялото, на мястото на класически и антицелулитен масаж.
                  <strong> RollShape</strong> e предназначен за ефективна борба
                  с целулита и наднорменото тегло. Той е уникална комбинация от
                  ролков масаж и инфрачервено лъчение. Инфрачервените лъчи
                  проникват до дълбочина от 4-6 см, предизвикват значително
                  подобряване на кръвообращението и потока на лимфата,
                  предизвикват тялото да се освободи от токсини, холестерол,
                  тежки метали, киселини и токсични вещества. Благодарение на
                  това, ефектът от тренировката се увеличава няколко пъти!
                  Редовното използване на ролковия масаж ви позволява значително
                  да намалите теглото си, да направите вашата фигура красива и
                  да оформите мускулатурата си. Ефектът може да бъде забелязан
                  след 2-3 тренировки! Ролковият масаж е необходим за трениране
                  на мускулите преди и след спорт, за да облекчи напрежението
                  след активна тренировка или работен ден! Тренировкa с
                  <strong> RollShape</strong> - също е отлична опция за тези,
                  които са доволни от собствената си фигура, но има малки
                  нюанси, които изискват корекция. С <strong>RollShape</strong>
                  можете да завършите тренировката си в нашия център, той ще ви
                  спаси от мускулна болка след тренировка.
                </div>
                <h3 className="text-center my-2">РЕЗУЛТАТИ</h3>
                <section className="dl-blurbs">
                  <dl>
                    <dt>намаляне на теглото</dt>
                    <dt>разбиване на целулита</dt>
                    <dt>укрепване на мускулите</dt>
                    <dt>намаляне на мастните депа в коремната област</dt>
                    <dt>намаляне на мастните депа в „паласките“</dt>
                    <dt>облекчава мускулното натоварване</dt>
                    <dt>подобрява кръвообращението и ускурява метаболизма</dt>
                    <dt>снабдява тъканите и органите с кислород</dt>
                    <dt>оформя и подържа фигурата</dt>
                  </dl>
                </section>
                <button
                  className="golden-btn"
                  onClick={() => scrollIntoView("item-3")}
                >
                  Запазете час
                </button>
              </div>
            </TabPanel>
            <TabPanel value={value} index={1} className="p-1">
              <h1 className="text-center">Телесен Анализ "Танита"</h1>
              <div style={{ textAlign: "justify" }} className="p-3">
                Японските професионални телесните анализатори "TАНИТА" са точни,
                надежни и осигуряват силно повтарящи се резултати. Те се
                използват по цял свят от специалисти в здравеопазването,
                медицината, спорта и научните изследвания, в следните области:
              </div>
              <section className="dl-blurbs">
                <dl>
                  <dt>Медицински скрининг и оценка на здравето;</dt>
                  <dt>
                    Наблюдение на напредъка в загубата на тегло по време на
                    лечение на болести, свързани с начина на живот (диабет,
                    хиперглекимия, хипертония, чернодробни болести и др.);
                  </dt>
                  <dt>
                    Наблюдение на повишаването нa мускулната маса, намаляването
                    на телесните мазнини и нивата на хидратация като част от
                    фитнес тренировъчни програми;
                  </dt>
                  <dt>
                    Оценка на ефективността на програмите за хранене и физическа
                    активност, където индекса на телесната маса не може да
                    идентифицира промени в състава на тялото; Телесния
                    анализатор "ТАНИТА" е предназначен за: измерване на теглото
                    и импенданса;
                  </dt>
                </dl>
              </section>
              <h3>Телесния анализатор "ТАНИТА" е предназначен за:</h3>
              <ul>
                <li>измерване на теглото и импенданса; </li>
                <li>оценка на индекса на телесната маса (BMI);</li>
                <li>
                  измерване на общия % и теглото на телесните мазнини и вода в
                  тялото;
                </li>
                <li>измерване на общата мускулна маса;</li>
                <li>
                  измерване на физически рейтинг, костна маса, висцеларна мастна
                  тъкан със здравословен обхват;
                </li>
                <li>
                  измерване на основната метаболитна скорост (BMR) и маса без
                  мазнини (FFM);
                </li>
              </ul>
              <div style={{ textAlign: "justify" }} className="p-3">
                Устройството е предназначено за използване при здрави деца и
                възрастни от 5 до 99год, с тегло до 270кг. Не се разрешава
                използването му от пациенти с пейсмейкъри или други механични
                импланти, от бременни жени, от хора с алергия към метал.
                <div className="text-center">
                  <button
                    className="golden-btn"
                    onClick={() => scrollIntoView("item-3")}
                  >
                    Запазете час
                  </button>
                </div>
              </div>
            </TabPanel>
            <TabPanel value={value} index={2} className="p-1">
              <h1 className="text-center">Мезотерапия</h1>
              <div style={{ textAlign: "justify" }} className="p-5">
                Мезотерапия е метод, основан на подкожно въвеждане на
                хуалуронови молекули, витамини, микроелементи, аминокиселини и
                други полезни съставки в кожата чрез инжектиране.
                <h4 className="m-3">
                  И защо казваме че тя намира решение на недостатък в
                  козметологията?
                </h4>
                Повечето от продуктите, от които може да се очаква по-осезаем
                ефект, след приложение върху кожата под формата на кремове или
                маски не проникват в средния слой на кожата, където е
                необходимо, за да се прояви тяхното пълно действие. Това се
                дължи на основната функция на кожата - защита на организма от
                проникване на всякакви външни за него вещества.
                <br />
                Чрез инжекционна мезотерапия се добавят необходимите елементи за
                една красива и млада кожа.
                <div className="text-center">
                  <button
                    className="golden-btn"
                    onClick={() => scrollIntoView("item-3")}
                  >
                    Запазете час
                  </button>
                </div>
              </div>
            </TabPanel>
            <TabPanel value={value} index={3} className="p-1">
              <h1 className="text-center">Микроблейдинг</h1>
              <div className="p-5" style={{ textAlign: "justify" }}>
                Микроблейдингът е техника за татуиране, при която малък ручен
                инструмент, направен от няколко малки игли, се използва за
                добавяне полупостоянен пигмент към кожата. Микроблейдингът се
                различава от стандартно татуиране на вежди, тъй като всеки косъм
                се създава ръчно с помощта на острие, което създава фини резени
                в кожата, докато татуирането на вежди се прави се прави с машина
                единична игла. Микроблейдингът обикновено използва върху веждите
                за създаване, подобряване или преоформяне на външния им вид по
                отношение както на формата, така и цвета. Той отлага пигмент в
                горната част на дермата, така че избледнява по-бързо от
                традиционните техники за татуиране, които отлагат пигмент
                по-дълбоко. Микроблейдинг худижниците не са непременно художници
                на татуировки и обратно, защото техниките изискват различно
                обучение.
                <div className="text-center">
                  <button
                    className="golden-btn"
                    onClick={() => scrollIntoView("item-3")}
                  >
                    Запазете час
                  </button>
                </div>
              </div>
            </TabPanel>
            <TabPanel value={value} index={4} className="p-1">
              <h1 className="text-center">Химичен Пилинг</h1>
              <div style={{ textAlign: "justify" }} className="p-5">
                Химичния пилинг <b>контролирано уврежда </b>
                горните слоеве на кожата с помощта на химически съставки с цел
                възобновяване и коригиране на естетическите несъвършенства.
                <hr />
                Химическият пилинг <b>стимулира защитната</b> реакция на тялото,
                благодарение на което се <b>увеличава</b> производството на
                хиалуронова киселина, колаген и еластин. А това, от своя страна,
                подобрява тонуса на кожата, нейния релеф и елиминира бръчките.
                <hr />С помощта на тази процедура може да решите широк спектър
                от проблеми - белези и следи от акне, старчески петна,
                неравномерен тен и други свързани с възрастта промени.
                <div className="text-center">
                  <button
                    className="golden-btn"
                    onClick={() => scrollIntoView("item-3")}
                  >
                    Запазете час
                  </button>
                </div>
              </div>
            </TabPanel>
            <TabPanel value={value} index={5} className="p-1">
              <h1 className="text-center">Дермабразио</h1>
              <div className="p-5" style={{ textAlign: "justify" }}>
                Метод за отстраняване на дефектите по кожата, не боли, кожата не
                се лющи и след излизане от салона лицето е спокойно. Тоест човек
                може да си направи финия пилинг през обедната почивка и никой да
                не разбере. Диамантите финаги са били сред най-добрите приятели
                на жената. И то не само когато са по пръстите или около шията. В
                козметичната индустрия този вид скъпоценни камъни се използват
                от години. Те не се разтварят в киселина, имат свойството да
                отблъскват водата и да привличат мазнините.
                <br />
                <br />
                Точно тези качества са залегнали в разработването на
                апаратурата, извършваща тази процедура - тя разполага с цял
                набор от диамантени накрайници, които нежно ексфолират мазна
                кожа с множество пори, пру тъмни кръгове под очите,
                хиперпигментация, белези, целулит и стрии, при загрубели лакти и
                колена, както и за отстраняване на фини, дълбоки и радиални
                бръчки. Приставките с различна големина и перфектно шлифовани
                диаманти в съчетание с вакуум предоставят възможност за
                почистване на участъци в непосредствена близост до очите, под
                веждите, над устните, та дори и в ушната мида. Продължителността
                на една процедура варира от 15 до 45 минути в зависимост от
                участъка и състоянието на кожата. Резултатите са видни още след
                първия пут, но за тотално чиста кожа специалистите пропоръчват
                минимум 6 посещения на козметичен салон. И дават гаранция, че ще
                сме точно толкова ослепителни след тях, колкото и холивудските
                звезди. Със сияещо лице, чиста кожа и изкусителни устни.
                <div className="text-center">
                  <button
                    className="golden-btn"
                    onClick={() => scrollIntoView("item-3")}
                  >
                    Запазете час
                  </button>
                </div>
              </div>
            </TabPanel>
            <TabPanel value={value} index={6} className="p-1">
              <h1 className="text-center">Инжектор Пен</h1>
              <div className="p-5" style={{ textAlign: "justify" }}>
                Инжектор пен или Хиаурон пен е иновативен козметичен уред, който
                работи без електричество с цел безиглено поставяне на филъри или
                подхранване на кожата благодарение на силно налягане. Така
                наречената спринцовка без игла е предназначена за подкожно
                инжектиране на дозирани продукти с течна или гелообразна форма
                без използване на игли. Уредът се състои от основано устройство
                и спинцовка за еднократна употреба.
                <div className="text-center">
                  <button
                    className="golden-btn"
                    onClick={() => scrollIntoView("item-3")}
                  >
                    Запазете час
                  </button>
                </div>
              </div>
            </TabPanel>
            <TabPanel value={value} index={7} className="text-center">
              <section className="dl-blurbs">
                <dt>Консултации</dt>
                <dt>Хранителни режими</dt>
                <dt>Процедури за тяло</dt>
                <dt>Процедури за лице</dt>
                <dt>Лифтинг</dt>
                <dt>Перманентен грим</dt>
                <dt>IPL</dt>
              </section>
              <button
                className="golden-btn"
                onClick={() => scrollIntoView("item-3")}
              >
                Запазете час
              </button>
            </TabPanel>
          </Grid>
        </Grid>
      </div>
    </div>
  );
};

export default Services;
