import "./styles/styles.scss";
import React from "react";
import Grid from "@mui/material/Grid";
import Contacts from "../contacts/Contacts";
import Footer from "../footer/Footer";
const VacuActive = () => {
  return (
    <div className="vacu-active position-relative">
      <a href="/">
        <img src="logo.svg" className="logo" />
      </a>
      <div className="container">
        <strong>
          <h3 className="text-center mt-4 vacu-title">
            Vaccu Activ BeautyLine
          </h3>
        </strong>
        <Grid container spacing={2} className="mt-5">
          <Grid
            item
            xs={12}
            md={12}
            sm={12}
            lg={6}
            className="align-items-center p-4"
            style={{ textAlign: "justify" }}
          >
            <div className="underlined-text">
              <strong>Vaccu Activ BeautyLine</strong> е иновативен уред в
              областта на оформяне на тялото, който съчетава движение, вакуум и
              инфрачервено лъчение с цел намаляне обема на корема, паласките,
              бедрата и краката, за да се отървете от целулита, както и да
              подобрите атлетичната си форма в най-кратки срокове. При
              тренировка с <strong>Vaccu Activ BeautyLine</strong> под
              въздействието на вакуум и инфрачервена светлина се подобрява
              микроциркулацията на кръвта и лимфния поток в дълбоките слоеве на
              подкожната тъкан. Това допринася за подобряване на метаболизма и
              трофизма на тъканите, повишаване клетъчна регенерация, ускоряване
              на възстановителните процеси в клетки и тъканите. Вградената
              колагенова лампа с помощта на светлинни вълни от определен
              диапазон стимулира синтеза на колаген. Нивото му се увеличава с
              20%. В същото време кожата започва да диша по-активно, да
              консумира кислород и токсините се извеждат активно. Кожата е
              стегната, изгладена, процесите на регенерация (възстановяване) са
              започнали. Колагенът осигурява здравина и еластичност на всички
              тъкани и органи. Арома терапията и Цвето терапията ще ви помогнат
              да се отпуснете, да подобрите настроението си, да намалите апетита
              и да се отървете от депресията!
            </div>
          </Grid>
          <Grid
            item
            xs={12}
            md={12}
            sm={12}
            lg={6}
            className="align-items-center"
          >
            <div className="gallery1">
              <ul>
                <li>
                  <img src="beuty-line1.jpeg" />
                </li>
                <li>
                  <img src="beuty-line3.jpeg" />
                </li>
                <li>
                  <img src="beuty-line2.jpeg" />
                </li>
                <li>
                  <img src="beuty-line4.jpeg" />
                </li>
              </ul>
            </div>
          </Grid>
        </Grid>
        <h3 className="my-3">
          ИЗРАЗХОДВАНЕ ДО 3000 КАЛОРИИ САМО В ЕДНА СЕСИЯ ОТ 30 МИНУТНИ !!!
        </h3>
        Една сесия от 30мин се равнява на 1 час кардио във фитнеса, като
        тренировките се провеждат индивидуално, а лицето участва активно в
        процеса. Пулса не надвишава здравословните удари в минута, а резултатите
        се усещат още от първия път! Препорачителни са поне 10 посещения на
        Vaccu Activ BeautyLine при които се наблюдава:
        <section className="dl-blurbs mt-2">
          <dl>
            <dt>
              значителен спад от 5 до 20 см от обема на тялото (телесни мазнини
              в "проблемните области" на корема, паласките, бедрата, краката)
            </dt>
            <dt>намаляне на телесното тегло до 10 кг</dt>
            <dt>изчезване или заглаждане на целулита</dt>
          </dl>
        </section>
        За по-упорити целулитни образования и натрувания на мастни депа в
        проблемните области, се препоръчва използването на двата апарата Vaccu
        Activ BeautyLine и Roll Shape за 1 час на ден поне 2 пъти седмично!
        Целта на тренировките във вакуум са:
        <section className="dl-blurbs mt-2">
          <dl>
            <dt>активиране на мастните клетки</dt>
            <dt>подобряване на лимфния дренаж</dt>
            <dt>премахване на натрупванията на токсини</dt>
            <dt>ускоряване на горенето на калории</dt>
            <dt>премахване на натрупванията на токсини</dt>
            <dt>подобрение на храносмилателната система</dt>
            <dt>подобряване еластичността на кожата</dt>
            <dt>намаляне цялотсно обема на тялото и премахване на целулита</dt>
          </dl>
        </section>
        <strong>Vaccu Activ BeautyLine</strong> е предназначен за тези, които
        искат сериозно и целенасочено да ускорят процеса на изгаряне на
        мазнините в проблемните области. Той Ви позволява бързо да преведете
        фигурата си в желаният и вид, да чувствате кожата си по-млада и тялото
        си по-атлетично. Подходящ е както за жени, така и за мъже. Vaccu Activ
        BeautyLine предлага различни процедури, като:
        <section className="dl-blurbs mt-2">
          <dl>
            <dt>
              SOFT WALK – предназначена за хора с наднормено тегло или тези,
              които водят „застоял“ начин на живот. Процедурата е лека и
              приятна, като разходка в парка, а изгорените калории са от 500cal
              само за 30мин! Процедурите могат да варират от 15мин до 30мин.
            </dt>
            <dt>
              AEROBIC – предназначена за хора, които посещават фитнеса или водят
              по-активен начин на живот. В тази процедура се набляга на умерено
              натоварване на краката, вакуумът и инфрачервените лампи ускоряват
              процеса на горене на мазнини, а изгорените калории са от 800cal
              само за 30мини! Процедурите могат да варират от 15мин до 30мин.
            </dt>
            <dt>
              FAST BURNING – предназначена за хора, които тренират активно или
              използват уреда по 2 пъти в седмицата. Инфрачервените лампи
              подържат висока температура, стимулирайки отделянето на токсините
              (потенето) топенето и горенето на мазнините в областта на корема,
              паласките,седалището, бедрата и целулита при жените, а изгорените
              калории са от 1500 cal. Вакуумът подпомага дренажа на лимфата и
              кръвообращението. Процедурите могат да варират от 15мин до 30мин.
            </dt>
            <dt>
              LYMHATIC DRAINAGE – е програма предназначена за дрениране на
              лимфата. Тази процедура е много подходяща и за борбата с целулита
              при жените. Вакуумът променя бара на налагането в капсулата
              периодично, подпомагайки церкулацията на кръвта и лимфата.
              Резултата е по-гладка и стегната кожа след само 2 процедури. Тази
              програма се препоръчва с комбинация от двата апарата Vaccu Activ
              BeautyLine и Roll Shape. Процедурите отнемат около 1 час в
              комбинация от двата апарата. Загубата на калории е от 1500 cal.
            </dt>
            <dt>
              MANUAL – тази програма позволява на клиента сам да избере
              скоростта и наклона на ходене, температурата в капсулата, която
              може да варира от 30 до 50 градуса С, както и налягането (вакуума)
              в капсулата (до 30 бара). Тук изгорените калории могат да
              достигнат до 3000, само за едно посещение при 30 минутна
              тренировка!
            </dt>
          </dl>
        </section>
      </div>
      <Contacts />
      <Footer />
    </div>
  );
};

export default VacuActive;
